In [1]:
import pandas as pd
import numpy as np

In [20]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)
s1

array([5, 4, 7, 1, 0])

In [33]:
sozluk = {"var1":s1,
        "var2":s2,
        "var3":s3}

In [34]:
bizimframe=pd.DataFrame(sozluk)
bizimframe

   var1  var2  var3
0     5     3     9
1     4     9     7
2     7     6     3
3     1     1     6
4     0     1     9

In [35]:
bizimframe[0:3]

   var1  var2  var3
0     5     3     9
1     4     9     7
2     7     6     3

In [36]:
bizimframe.index=["a","b","c","d","e"]

In [37]:
bizimframe

   var1  var2  var3
a     5     3     9
b     4     9     7
c     7     6     3
d     1     1     6
e     0     1     9

In [38]:
bizimframe["c":"e"]

   var1  var2  var3
c     7     6     3
d     1     1     6
e     0     1     9

In [39]:
bizimframe.drop("a",axis=0)

   var1  var2  var3
b     4     9     7
c     7     6     3
d     1     1     6
e     0     1     9

In [40]:
bizimframe

   var1  var2  var3
a     5     3     9
b     4     9     7
c     7     6     3
d     1     1     6
e     0     1     9

In [41]:
bizimframe.drop("a", axis = 0, inplace=True)

In [42]:
df

   var1  var2  var3
b     4     9     7
c     7     6     3
d     1     1     6
e     0     1     9

In [43]:
l = ["c","e"]

In [44]:
bizimframe.drop(l, axis = 0)

   var1  var2  var3
b     4     9     7
d     1     1     6

In [45]:
# degiskenler icin

In [47]:
"var1" in bizimframe

True

In [48]:
L = ["var1","var4","var2"]

In [49]:
for i  in L:
    print(i in bizimframe)

True
False
True

In [50]:
bizimframe

   var1  var2  var3
b     4     9     7
c     7     6     3
d     1     1     6
e     0     1     9

In [51]:
bizimframe["var2"]

b    9
c    6
d    1
e    1
Name: var2, dtype: int32

In [57]:
bizimframe["var4"] = bizimframe["var1"] / bizimframe["var2"]
bizimframe

   var1  var2  var3      var4
b     4     9     7  0.444444
c     7     6     3  1.166667
d     1     1     6  1.000000
e     0     1     9  0.000000

In [58]:
bizimframe.drop("var4", axis = 1)

   var1  var2  var3
b     4     9     7
c     7     6     3
d     1     1     6
e     0     1     9

In [59]:
bizimframe.drop("var4",axis=1,inplace=True)

In [61]:
l = ["var1","var2"]
bizimframe.drop(l,axis=1)

   var3
b     7
c     3
d     6
e     9